"""
Задание 1.

a) Во второй элемент кортежа (1, [2, 3]) добавьте еще один элемент: 4.

b) К кортежу (1, [2, 3]) добавьте список из трех элементов.

c) К кортежу (1, [2, 3]) добавьте еще один элемент: строку.

d) Во втором элементе кортежа (1, [2, 3]) повторите еще раз имеющийся список.
"""

print('task a')
a1 = (1, [2, 3])
el_2 = a1[1]
el_2.append(4)
print('Result: ', end="")
print(a1)

print('task b')
b1 = (1, [2, 3])
b1+= [100, 101, 110],
# b2 = (b1, [100, 101, 110])
print(b1)
print('Result: ', end="")
# print(b2)

print('task c')
c1 = (1, [2, 3])
c2 = (c1, 'str')
print(c1)
print('Result: ', end="")
print(c2)

print('task d')
d1 = (1, [2, 3])
d1[1]*2
d2 = (d1, [2, 3])
print(d1)
print('Result: ', end="")
# print(d2)
